In [52]:
import mysql.connector
import pandas as pd

In [53]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'sakila'
)

In [7]:
mycursor = mydb.cursor()

query = '''
select * from film
'''

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"{Behind the Scenes, Commentaries}",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,{Deleted Scenes},2006-02-15 05:03:42

# SOAL NO. 1

Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan
urasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length.

In [54]:
mycursor = mydb.cursor()

query = '''
select f.title, fl.category, f.length 
from film f inner join film_list fl using(title)
where fl.category = 'Comedy'
order by length
limit 10
'''

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

# SOAL NO. 2

Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa
DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang
diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa.

In [55]:
mycursor = mydb.cursor()

query = '''
select fl.category, count(fl.category), sf.total_sales
from film_list fl inner join sales_by_film_category sf using(category)
group by category
'''

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

       category  count(fl.category) total_sales
0   Documentary                  68     4217.52
1        Horror                  56     3722.54
2        Family                  69     4226.07
3       Foreign                  73     4270.67
4        Comedy                  58     4383.58
5        Sports                  73     5314.21
6         Music                  51     3417.72
7      Classics                  57     3639.59
8     Animation                  66     4656.30
9        Action                  64     4375.85
10          New                  63     4351.62
11       Sci-Fi                  61     4756.98
12        Drama                  61     4587.39
13       Travel                  56     3549.64
14        Games                  61     4281.33
15     Children                  60     3655.55

# SOAL NO. 3

Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan
minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan
dari aktor/aktris yang membintangi film terbanyak.

In [56]:
mycursor = mydb.cursor()

query = '''
select a.actor_id, a.first_name, a.last_name, count(fc.category_id) as jumlah_Movie
from actor a inner join film_actor fa using(actor_id)
inner join film_category fc using(film_id)
group by a.actor_id
order by jumlah_Movie desc
limit 10
'''

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   actor_id first_name  last_name  jumlah_Movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

# SOAL NO. 4

Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi
film, dengan total 42 judul film. Kategori film apakah yang paling banyak dibintanginya? Untuk
mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh
Gina Degeneres. Kolom yang diwajibkan ada yaitu kategori film dan jumlah film yang dibintangi.

In [57]:
mycursor = mydb.cursor()

query = '''
select c.name, count(fc.category_id) as jumlah_Movie
from actor a inner join film_actor fa using(actor_id)
inner join film_category fc using(film_id)
inner join category c using(category_id)
where a.first_name = 'Gina'
group by c.name
'''

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

           name  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

# SOAL NO. 5

Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre
sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi
oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya.

In [58]:
mycursor = mydb.cursor()

query = '''
select f.title, fl.category 
from actor a inner join film_actor fa using(actor_id)
inner join film f using(film_id)
inner join film_list fl using(title)
where a.first_name = 'Gina' and fl.category = 'Sci-Fi'
'''

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi